CORE/Source/libs/indy10/Demos/soap/dunit/SoapBuilders/echoIntegerArray.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:xsd="http://www.w3.org/1999/XMLSchema">
<SOAP-ENV:Body>
<namesp1:echoIntegerArray xmlns:namesp1="http://soapinterop.org/">
<inputIntegerArray SOAP-ENC:arrayType="xsd:int[7]"
xsi:type="SOAP-ENC:Array">
<c-gensym5 xsi:type="xsd:int">-1</c-gensym5>
<c-gensym5 xsi:type="xsd:int">0</c-gensym5>
<c-gensym5 xsi:type="xsd:int">1</c-gensym5>
<c-gensym5 xsi:type="xsd:int">2</c-gensym5>
<c-gensym5 xsi:type="xsd:int">3</c-gensym5>
<c-gensym5 xsi:type="xsd:int">4</c-gensym5>
<c-gensym5 xsi:type="xsd:int">5</c-gensym5>
</inputIntegerArray>
</namesp1:echoIntegerArray>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
