CORE/Source/libs/indy10/Demos/soap/dunit/SoapBuilders/echoInteger.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" 
SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:xsd="http://www.w3.org/1999/XMLSchema">
<SOAP-ENV:Body>
<namesp1:echoInteger xmlns:namesp1="http://soapinterop.org/">
<inputInteger xsi:type="xsd:int">5</inputInteger>
</namesp1:echoInteger>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
