CORE/Source/libs/indy10/Demos/soap/dunit/SoapBuilders/echoFloatArray.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:xsd="http://www.w3.org/1999/XMLSchema">
<SOAP-ENV:Body>
<namesp1:echoFloatArray xmlns:namesp1="http://soapinterop.org/">
<inputFloatArray SOAP-ENC:arrayType="xsd:float[3]"
xsi:type="SOAP-ENC:Array">
<c-gensym5 xsi:type="xsd:float">5.2</c-gensym5>
<c-gensym5 xsi:type="xsd:float">6.2</c-gensym5>
<c-gensym5 xsi:type="xsd:float">-1.3</c-gensym5>
</inputFloatArray>
</namesp1:echoFloatArray>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
