CORE/Source/libs/indy10/Demos/soap/dunit/SoapBuilders/echoStruct.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:xsd="http://www.w3.org/1999/XMLSchema"
xmlns:namesp1="http://soapinterop.org/xsd">
<SOAP-ENV:Body>
<namesp2:echoStruct xmlns:namesp2="http://soapinterop.org/">
<inputStruct xsi:type="namesp1:SOAPStruct">
<varFloat xsi:type="xsd:float">6.2</varFloat>
<varString xsi:type="xsd:string">test string</varString>
<varInt xsi:type="xsd:int">5</varInt>
</inputStruct>
</namesp2:echoStruct>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
